package com.example.mytest.dto

data class FlowerDetail(

    val dogam_1 : String = "다른 꽃들과는 달리 기온이 낮은 가을에 피는 특성 때문에 조상들은 은둔하면서 절개를 지키는 군자의 상징으로 여겨, 사군자의 하나로 귀하게 여겼습니다. " +
            "꽃을 말린 것을 베개 속에 넣어두면 두통에 효과가 있고, 이불솜에 넣으면 그윽한 향기를 즐길 수 있습니다.",
//            "세계적으로는 흰 장미를 장례에 가장 으뜸 꽃으로 여기지만, 국내를 포함한 동양에서는 흰 장미를 구하기 힘들어서 이 꽃으로 헌화를 하는 독특한 문화가 있습니다."
    val dogam_meaning_1 : String = "실망, 짝사랑",
    val dogam_2 : String = "다른 꽃들과는 달리 기온이 낮은 가을에 피는 특성 때문에 조상들은 은둔하면서 절개를 지키는 군자의 상징으로 여겨, 사군자의 하나로 귀하게 여겼습니다. " +
            "꽃을 말린 것을 베개 속에 넣어두면 두통에 효과가 있고, 이불솜에 넣으면 그윽한 향기를 즐길 수 있습니다.",
    val dogam_meaning_2 : String = "당신을 사랑합니다",
    val dogam_3 : String = "다른 꽃들과는 달리 기온이 낮은 가을에 피는 특성 때문에 조상들은 은둔하면서 절개를 지키는 군자의 상징으로 여겨, 사군자의 하나로 귀하게 여겼습니다. " +
            "꽃을 말린 것을 베개 속에 넣어두면 두통에 효과가 있고, 이불솜에 넣으면 그윽한 향기를 즐길 수 있습니다.",
    val dogam_meaning_3 : String = "내 모든 것을 그대에게",
    val dogam_4 : String = "세계적으로 가장 많이 사랑받는 대표적인 꽃입니다." +
            "그리스 로마 신화부터 문학과 미술 등 예술을 꽃피우는 소재이기도 했습니다." +
            "향수와 화장품에도 널리 쓰이고 있으며, 이 꽃을 이용한 정원이나 축제는 아름다운 관광지로 인기가 높습니다.",
    val dogam_meaning_4 : String = "사랑, 아름다움",
    val dogam_5 : String = "과거에는 실존하지 않는 꽃이었습니다. " +
            "이 꽃은 푸른색을 내는 색소가 유전자가 없기 때문입니다. 그 때문에 일찍부터 이 꽃은 '신비로움' 이나 '불가능' 이라는 꽃말이 있었습니다." +
            "하지만 2004년 이 꽃의 개발에 성공하면서 아래와 같은 새로운 꽃말이 추가되었습니다.",
    val dogam_meaning_5 : String = "포기하지 않는 사랑",
    val dogam_6 : String = "세계에서 가장 유명한 꽃인 이 꽃은, 그 색깔에 따라 매우 다양한 꽃말을 가집니다" +
            "붉은 색일 경우에는 '사랑', '아름다움' 의 의미를 가지고 있는 반면 " +
            "이 색일 경우에는 아래와 같은 의미도 담고 있기에, 기념일 선물용으로는 주의가 필요하겠습니다.",
    val dogam_meaning_6 : String = "변하지 않는 사랑",
    val dogam_7 : String = "가격이 저렴하고 기르기도 쉬워 초보자가 키우기 적합합니다. " +
            "하지만 기르기 쉬운 것과 꽃 피우기 쉬운 것은 별개입니다. " +
            "기온이 높은 한국의 여름에서는 꽃을 한번 피우고 나면, 양분을 저장할 시간이 부족해 이듬해에 개화율이 크게 떨어집니다.",
    val dogam_meaning_7 : String = "수줍음, 부끄러움",
    val dogam_8 : String = "네덜란드의 국화이기도 하며, 터키의 국화이기도 합니다. " +
            "무슬림이나 인도인이 머리에 착용하는 '터번' 에서 이름이 유래되었다고 합니다. " +
            "기온이 높은 한국의 여름에서는 꽃을 한번 피우고 나면, 양분을 저장할 시간이 부족해 이듬해에 개화율이 크게 떨어집니다.",
    val dogam_meaning_8 : String = "영원한 사랑",
    val dogam_9 : String = "17세기 네덜란드에서는 이 꽃 투기 파동이 일어나기도 하였습니다." +
            "1636년 '황제' 라는 이름의 희귀 품종은 소 20마리 값에 거래되었으며, 현재 가치로는 3000만원에 달했다고 합니다. " +
            "하지만 어느날 갑자기 가격이 폭락해 4개월만에 100분의 1 가격이 되며 투기 파동은 끝이 납니다.",
    val dogam_meaning_9 : String = "사랑의 시작, 애정",
    val dogam_10 : String = "문학작품이나 영화에 초여름을 상징하는 꽃으로 자주 등장합니다. " +
            "꽃피는 시절이 장마철과 겹치므로 비를 맞는 이 꽃이 서정적으로 묘사되는 경우가 많습니다. " +
            "장마철에 꽃을 피우는 이유는 이름에서도 알 수 있듯 물을 많이 필요로 하는 꽃이기 때문입니다. ",
    val dogam_meaning_10 : String = "소녀의 꿈",
    val dogam_11 : String = "문학작품이나 영화에 초여름을 상징하는 꽃으로 자주 등장합니다. " +
            "땅의 산성도에 따라 꽃의 색이 달라지는데 산성 토양에서는 파란색을 띄고, 염기성 토양에서는 붉은색을 띕니다. " +
            "중성 토양에서는 흰색을 띈다고 합니다. ",
    val dogam_meaning_11 : String = "진심, 변덕",
    val dogam_12 : String = "문학작품이나 영화에 초여름을 상징하는 꽃으로 자주 등장합니다." +
            "땅의 산성도에 따라 꽃의 색이 달라지는데 산성 토양에서는 파란색을 띄고, 염기성 토양에서는 붉은색을 띕니다." +
            "중성 토양에서는 흰색을 띈다고 합니다. ",
    val dogam_meaning_12 : String = "냉정, 거만, 무정",
    val dogam_13 : String = "해를 닮은 노란 꽃이 인상적인 식물입니다." +
            "이름에도 '해' 가 들어가 듯 많은 사람들이 하루 종일 해를 바라본다고 있고 있으나 이는 잘못된 상식입니다." +
            "영양소 합성을 위해 봉오리가 피기 전까지만 해를 향하게 방향을 바꾸고, 꽃이 핀 후에는 방향을 바꾸지 않습니다.",
    val dogam_meaning_13 : String = "동경, 숭배, 기다림",
    val dogam_14 : String =
        "비화에서 유일하게 꽃이 아닌 식물입니다." +
            "한국에는 원래 없었지만, 근세에 외국에서 전해진 귀화 식물입니다. 다른 이름으로 토끼풀이라는 이름이 있습니다. " +
            "잎이 4개가 달린 이 식물은 행운을 가져다 준다는 이야기가 있습니다. ",
    val dogam_meaning_14 : String = "약속, 행운, 평화",
    val dogam_15 : String = "긴 겨울이 지나고 따뜻한 봄이 찾아 온것을 상징하는 꽃입니다. " +
            "흔히보이는 이 꽃은 한국의 특산종입니다. " +
            "추운날이 계속 되다 갑자기 날이 풀리면 11, 12월에도 개화를 하는 경우가 있고 번식력도 강해 아래와 같은 꽃말을 가지고 있습니다.",
    val dogam_meaning_15 : String = "희망",
    val dogam_16 : String = "이 꽃이 만발한 3, 4월의 풍경은 가히 절경이라고 할 만 합니다. " +
            "바람에 꽃잎이 흩날려 눈과 비처럼 쏟아지는 광경은 장관입니다. " +
            "이 꽃은 일본의 국화로 알려져 있기도 한데 이는 사실이 아니며 일본 황실의 상징, 일본 여권에 들어가는 꽃은 국화(菊花)입니다.",
    val dogam_meaning_16 : String = "아름다움",
    val dogam_17 : String = "순우리말로는 나리라고 합니다" +
            "향기가 진한 것으로 유명하고 그 향은 숙면에도 도움을 준다고 합니다." +
            "이 꽃의 형태를 딴 심볼은 유럽의 국기, 종교, 왕가의 상징물에 널리 사용되고 있습니다.",
    val dogam_meaning_17 : String = "순결, 순수한 사랑",
    val dogam_18 : String = "귀여운 노란색의 꽃으로 아름다운 꽃다발로 만들 수 있는 꽃입니다. " +
            "달콤한 향기를 자랑하는 것으로도 유명합니다. " +
            "이 꽃의 향기 성분은 향수, 탈취제로도 사용되며 마음을 진정시키는 효과가 있다고 알려져 있습니다.",
    val dogam_meaning_18 : String = "순결, 우정",
    val dogam_19 : String = "멕시코 출신의 잡초로 들이나 길가 아무데서나 흐드러지게 핀 것을 많이 볼 수 있는 꽃입니다. " +
            "굳이 돌봐주지 않아도 씩씩하게 자라며 모양이 소박하면서도 아름다워 인기가 높습니다. " +
            "잠자리와 더불어 가을의 전령으로 환영 받습니다.",
    val dogam_meaning_19 : String = "순결, 순정",
    val dogam_20 : String = "봄꽃 중 화사하기로는 제일가는 꽃입니다." +
            "화전으로도 먹을 수 있고, 꽃을 뜯어다 꽁지를 떼고 빨아먹어 보면 달콤한 꿀맛을 볼 수 있습니다." +
            "무궁화 대신 새로운 국화를 제정하자고 주장하는 측에서 새 국화 후보 1순위로 미는 꽃이기도 합니다.",
    val dogam_meaning_20 : String = "사랑, 기쁨",
    val dogam_21 : String = "대한민국의 국화로 여겨지고 있지만, 사실 대한민국에서 명백히 법으로 규정된 국화는 없습니다. " +
            "색이 은은하고 꽃이 오래가서 민족의 기상을 닮았다고 일컫습니다. " +
            "아침에 피어 저녁에 지는 꽃이지만, 매일 피고 지기를 반복하는 모습은 질긴 생명력과 민족의 저항정신을 상징합니다.",
    val dogam_meaning_21 : String = "끈기",
    val dogam_22 : String = "어디서나 흔하게 보이는 꽃으로 노란 꽃이 인상적입니다. " +
            "꽃이 지고 나면 솜털 같은 깃이 달린 씨앗들이 나와 바람을 타고 널리 퍼집니다. " +
            "한의학에서는 소화제, 해열제로도 사용되며 오래전부터 차로 끓여 마시기도 하였습니다.",
    val dogam_meaning_22 : String = "사랑의 사도, 불사신",
    val dogam_23 : String = "인도가 원산지인 꽃으로 연못위에 둥둥 떠 자라기도 하지만 논이나 늪의 진흙속에서도 잘 자랍니다. " +
            "잎은 물을 튕겨내는 성질이 있어 고기, 생선, 밥 같이 수분이 많은 식자재를 쌀 때 유용하여 요리에도 자주 사용됩니다. " +
            "우리나라에서 700년 된 이 꽃 씨앗이 발아하여 '아라홍련' 이라는 이름이 붙여지기도 하였습니다.",
    val dogam_meaning_23 : String = "소원해진 사랑",
)
